<a href="https://colab.research.google.com/github/Twilight1029/Python-for-Data-Analysis/blob/main/Python_for_Data_Analysis_CH7.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# CHAPTER 7 Data Cleaning and Preparation

## 7.1 Handling Missing Data
Numeric data: Use the floating-point value NaN ( sentinal value )<br>
NA data may either be data that does not exist or that exists but was not observed<br>
The built-in Python None value is also tearted as NA in object arrays<br>

### 1. Filtering out Missing Data

#### Filtering in Series

In [ ]:
from numpy import nan as NA
import pandas as pd
import numpy as np

In [ ]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [ ]:
# dropna()

data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [ ]:
# pandas.notnull() + boolean indexing --> filter

data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [ ]:
# Filtering in DataFrame

data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], 
                     [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
# dropna() by default drops any rows containing NA items

cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [ ]:
# passing how = 'all' will only drop rows that are all NA

data.dropna(how = 'all') # pass axis = 1 to drop columns

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
# To keep certain rows containing specific observations

df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  0.012297  0.494544  0.706971
1 -2.249439 -0.164904 -1.933415
2  0.809113  0.790849 -0.611867
3 -0.635967 -0.767132  1.689101
4  1.065268  0.094950  1.009103
5 -1.115442  0.813824 -0.390950
6  0.545543  0.530738  2.795619

In [ ]:
df.iloc[:4, 1] = NA
df

          0         1         2
0  0.012297       NaN  0.706971
1 -2.249439       NaN -1.933415
2  0.809113       NaN -0.611867
3 -0.635967       NaN  1.689101
4  1.065268  0.094950  1.009103
5 -1.115442  0.813824 -0.390950
6  0.545543  0.530738  2.795619

In [ ]:
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.012297       NaN       NaN
1 -2.249439       NaN       NaN
2  0.809113       NaN -0.611867
3 -0.635967       NaN  1.689101
4  1.065268  0.094950  1.009103
5 -1.115442  0.813824 -0.390950
6  0.545543  0.530738  2.795619

In [ ]:
df.dropna() # drop all rows with NA

          0         1         2
4  1.065268  0.094950  1.009103
5 -1.115442  0.813824 -0.390950
6  0.545543  0.530738  2.795619

In [ ]:
df.dropna(thresh = 2) # drop rows with >= 2 NAs

          0         1         2
2  0.809113       NaN -0.611867
3 -0.635967       NaN  1.689101
4  1.065268  0.094950  1.009103
5 -1.115442  0.813824 -0.390950
6  0.545543  0.530738  2.795619

### 2. Filling in Missing Data

In [ ]:
# replace missing value with a constant

df.fillna(0)

          0         1         2
0  0.012297  0.000000  0.000000
1 -2.249439  0.000000  0.000000
2  0.809113  0.000000 -0.611867
3 -0.635967  0.000000  1.689101
4  1.065268  0.094950  1.009103
5 -1.115442  0.813824 -0.390950
6  0.545543  0.530738  2.795619

In [ ]:
# calling fillna with a dict to pass different value for each column
# fill 0.5 for NAs in column 1, fill o for NAs in column 2

df.fillna({1:0.5, 2:0}) # to modify the existing object, use inplace = True

          0         1         2
0  0.012297  0.500000  0.000000
1 -2.249439  0.500000  0.000000
2  0.809113  0.500000 -0.611867
3 -0.635967  0.500000  1.689101
4  1.065268  0.094950  1.009103
5 -1.115442  0.813824 -0.390950
6  0.545543  0.530738  2.795619

In [ ]:
# forward fill

df1 = pd.DataFrame(np.random.randn(6, 3))
df1

          0         1         2
0  1.289919  0.425634  0.912402
1  1.383089 -2.608307  1.072225
2  0.213721 -0.110109  3.118280
3  0.477728  0.691564 -0.656783
4 -2.313215 -1.296927 -0.202879
5  0.365068 -0.446621  0.218904

In [ ]:
df1.iloc[2:, 1] = NA
df1

          0         1         2
0  1.289919  0.425634  0.912402
1  1.383089 -2.608307  1.072225
2  0.213721       NaN  3.118280
3  0.477728       NaN -0.656783
4 -2.313215       NaN -0.202879
5  0.365068       NaN  0.218904

In [ ]:
df1.iloc[4:, 2] = NA
df1

          0         1         2
0  1.289919  0.425634  0.912402
1  1.383089 -2.608307  1.072225
2  0.213721       NaN  3.118280
3  0.477728       NaN -0.656783
4 -2.313215       NaN       NaN
5  0.365068       NaN       NaN

In [ ]:
# can pass limit = argument to restrict the number of ffills
# fill the NAs with the last value in the dataframe

df1.fillna(method = 'ffill')

          0         1         2
0  1.289919  0.425634  0.912402
1  1.383089 -2.608307  1.072225
2  0.213721 -2.608307  3.118280
3  0.477728 -2.608307 -0.656783
4 -2.313215 -2.608307 -0.656783
5  0.365068 -2.608307 -0.656783

## 7.2 Data Transformation

In [ ]:
# removing duplicates

df2 =pd.DataFrame({'k1':['one', 'two', 'one', 'two', 'one', 'two', 'two'],
       'k2':[1, 1, 2, 3, 3, 4, 4]})
df2

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

* **duplicated** returns a boolean Series indicating whether each row is a duplicate(has been observed in the previous rows)

In [ ]:
df2.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

* **drop_duplicates()** : returns DataFrame where duplicated array is false

In [ ]:
df2.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

* Enter the column name to specify the columns to consider

* By DEFAULT keep the first observed value combination<br>
* Pass keep = 'last' will return the last one

In [ ]:
df2.drop_duplicates(['k1', 'k2'], keep = 'last')

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

### Transforming Data using Function or Mapping

In [ ]:
data = pd.DataFrame({'food':['bacon', 'pulled pork', 'bacon',
                            'pastrami', 'corned beef', 'bacon',
                           'pastrami', 'honey ham', 'nova lox'],
                   'ouces': [4., 3., 12., 6., 7.5, 8., 3., 5., 6.]})

data

          food  ouces
0        bacon    4.0
1  pulled pork    3.0
2        bacon   12.0
3     pastrami    6.0
4  corned beef    7.5
5        bacon    8.0
6     pastrami    3.0
7    honey ham    5.0
8     nova lox    6.0

In [ ]:
# add a column

meat_to_animal = {
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'honey ham':'pig',
    'nova lox':'salmon',
    'corned beef':'cow'
}

In [ ]:
# str.lower() to convert each value to lower case

lowercase = data['food'].str.lower()

In [ ]:
lowercase

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [ ]:
# map method on a Series accepts a function or a dict-like object
# containing a mapping

# find the corresponding dict value using the key in dict-->
# in here, find the food(lowercase) in meat_to_animal

data['animal'] = lowercase.map(meat_to_animal)

In [ ]:
data

          food  ouces  animal
0        bacon    4.0     pig
1  pulled pork    3.0     pig
2        bacon   12.0     pig
3     pastrami    6.0     cow
4  corned beef    7.5     cow
5        bacon    8.0     pig
6     pastrami    3.0     cow
7    honey ham    5.0     pig
8     nova lox    6.0  salmon

In [ ]:
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon',
 'corned beef': 'cow'}

In [ ]:
# pass a lambda functoin

data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [ ]:
# replacing values

data = pd.Series([1., -999, 2., -999, -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [ ]:
# use replace = to replace the null values
# use inplace = True to modify existing eries

data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [ ]:
data.replace([-999, -1000], np.nan) # replace multiple values

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [ ]:
# use different replacement for each value

data.replace([-999, -1000], [np.nan, 11111])

0        1.0
1        NaN
2        2.0
3        NaN
4    11111.0
5        3.0
dtype: float64

In [ ]:
# renaming axis indexes

data = pd.DataFrame(np.arange(12).reshape(3, 4),
                   index = ['Ohio', 'Colorado', 'New York'],
                   columns = ['one', 'two', 'three', 'four'])

In [ ]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [ ]:
# capitalize the index,use map

transform = lambda x: x[:10].upper()
data.index.map(transform)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [ ]:
# create a transformed version of a dataset without modifying the original
# str.title capitalize the first character of a str

data.rename(index = str.title, columns = str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [ ]:
# rename can be used in conjunction with a dict-like object for a subset of the axis labels

# can use inplace = Ture

data.rename(index = {'Ohio':'Indiana'}, columns = {'two':'Two'})

          one  Two  three  four
Indiana     0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

### Discretization and Binning

In [ ]:
age = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [ ]:
# Divide into bins of distinct groups

bins = [18, 25, 35, 60, 100]

In [ ]:
# can change which side is open with right = False
cats = pd.cut(age, bins)

In [ ]:
# returns a categorical object

cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [ ]:
# various attributes

cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [ ]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [ ]:
# return the bin counts

pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [ ]:
# label the bin names

pd.cut(age, bins, labels = ['Youth', 'Young Adult', 'Middle Aged',
                           'Senior'])

['Youth', 'Youth', 'Youth', 'Young Adult', 'Youth', ..., 'Young Adult', 'Senior', 'Middle Aged', 'Middle Aged', 'Young Adult']
Length: 12
Categories (4, object): ['Youth' < 'Young Adult' < 'Middle Aged' < 'Senior']

* Pass an integer number of bins to **cut** will compute **equal length bins** based on the minimum and maximum values in the data

In [ ]:
data = np.random.randn(20)

In [ ]:
data_cut = pd.cut(data, 4, precision = 2) # precision = 2 limits the decimal precision to two digits

In [ ]:
data_cut.codes

array([2, 0, 2, 3, 0, 0, 1, 1, 0, 2, 2, 2, 0, 3, 2, 3, 1, 2, 2, 1],
      dtype=int8)

* **qcut**: Based in sample quantiles: obtain rougly equal sized bins

In [ ]:
data = np.random.rand(1000) # normally distributed

In [ ]:
cats = pd.qcut(data, 4) # cut into quartiles

In [ ]:
cats

[(0.487, 0.745], (0.268, 0.487], (-0.00082, 0.268], (0.487, 0.745], (0.268, 0.487], ..., (0.745, 1.0], (0.745, 1.0], (0.268, 0.487], (0.745, 1.0], (0.745, 1.0]]
Length: 1000
Categories (4, interval[float64]): [(-0.00082, 0.268] < (0.268, 0.487] < (0.487, 0.745] < (0.745, 1.0]]

In [ ]:
pd.value_counts(cats)

(0.745, 1.0]         250
(0.487, 0.745]       250
(0.268, 0.487]       250
(-0.00082, 0.268]    250
dtype: int64

* qcut can pass quantiles (numbers between 0 and 1, inclusive)

In [ ]:
cats = pd.qcut(data, [0, .1, .5, .9, 1.], precision = 0)
cats

[(0.5, 0.9], (0.1, 0.5], (0.1, 0.5], (0.5, 0.9], (0.1, 0.5], ..., (0.9, 1.0], (0.5, 0.9], (0.1, 0.5], (0.5, 0.9], (0.9, 1.0]]
Length: 1000
Categories (4, interval[float64]): [(-0.0998, 0.1] < (0.1, 0.5] < (0.5, 0.9] < (0.9, 1.0]]

In [ ]:
pd.value_counts(cats)

(0.5, 0.9]        400
(0.1, 0.5]        400
(0.9, 1.0]        100
(-0.0998, 0.1]    100
dtype: int64

### Detecting and Filtering Outliers

In [ ]:
data = pd.DataFrame(np.random.rand(1000, 4))
data

            0         1         2         3
0    0.399616  0.719736  0.991011  0.217086
1    0.325585  0.159718  0.402856  0.738612
2    0.890866  0.890998  0.908208  0.648377
3    0.767417  0.841903  0.900692  0.732769
4    0.407515  0.393678  0.658837  0.608314
..        ...       ...       ...       ...
995  0.372548  0.372426  0.802663  0.867461
996  0.706613  0.052427  0.265990  0.551467
997  0.697282  0.858639  0.726177  0.641727
998  0.499646  0.573406  0.654076  0.643269
999  0.053901  0.580415  0.910589  0.436026

[1000 rows x 4 columns]

In [ ]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.490071     0.507427     0.489992     0.506454
std       0.285709     0.289266     0.290384     0.289455
min       0.000133     0.000725     0.000317     0.002483
25%       0.243927     0.258906     0.238908     0.258880
50%       0.495706     0.514586     0.496692     0.502553
75%       0.731951     0.756543     0.742411     0.771455
max       0.999997     0.999759     0.999667     0.997829

In [ ]:
# find values in one of the columns exceeding 0.999 in absolute value

col = data[2]

In [ ]:
col[np.abs(col) > 0.999]

904    0.999651
943    0.999667
Name: 2, dtype: float64

In [ ]:
# select all rows having abs value exceeding 0.999
# use ANY in boolean DataFrame

data[np.abs(data > 0.999).any(1)] # true = 1

            0         1         2         3
24   0.999997  0.186546  0.261475  0.911220
176  0.586561  0.999160  0.216386  0.531450
257  0.999554  0.907702  0.298524  0.813041
333  0.608005  0.999759  0.610651  0.489045
904  0.293677  0.562027  0.999651  0.030259
943  0.578862  0.123322  0.999667  0.065791

In [ ]:
np.sign(data)

       0    1    2    3
0    1.0  1.0  1.0  1.0
1    1.0  1.0  1.0  1.0
2    1.0  1.0  1.0  1.0
3    1.0  1.0  1.0  1.0
4    1.0  1.0  1.0  1.0
..   ...  ...  ...  ...
995  1.0  1.0  1.0  1.0
996  1.0  1.0  1.0  1.0
997  1.0  1.0  1.0  1.0
998  1.0  1.0  1.0  1.0
999  1.0  1.0  1.0  1.0

[1000 rows x 4 columns]

In [ ]:
# set values based on certain criterias

data[np.abs(data > 0.999).any(1)] = np.sign(data) * 0.999

# np.sign(data) produces 1 and -1 values based on 
# whether the values in the data are positive or negative

In [ ]:
data[np.abs(data >= 0.999).any(1)]

         0      1      2      3
24   0.999  0.999  0.999  0.999
176  0.999  0.999  0.999  0.999
257  0.999  0.999  0.999  0.999
333  0.999  0.999  0.999  0.999
904  0.999  0.999  0.999  0.999
943  0.999  0.999  0.999  0.999

### Permutaion and Random Sampling

In [ ]:
df = pd.DataFrame(np.arange(5 * 4).reshape(5, 4))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [ ]:
# Use permutation with the length of the axis you want to permute 
# produces an array of integers ( indexing)


sample = np.random.permutation(5)
sample

array([3, 4, 2, 1, 0])

In [ ]:
# apply to the datafrme with iloc or equivalent take function

df.iloc[sample,:]

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
2   8   9  10  11
1   4   5   6   7
0   0   1   2   3

In [ ]:
df.take(sample)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
2   8   9  10  11
1   4   5   6   7
0   0   1   2   3

In [ ]:
# generate a subset with or without replacement

df.sample(n = 3)

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
1   4   5   6   7

In [ ]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [ ]:
df.sample(n = 3, replace = True)

    0   1   2   3
4  16  17  18  19
4  16  17  18  19
0   0   1   2   3

### Computing Indicator/Dummy Variables

In [ ]:
df = pd.DataFrame({'key':[ 'b', 'b', 'a', 'c', 'a', 'b'],
                  'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [ ]:
# use the built in get_dummies function

pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [ ]:
# add a prefix to the columns in the indicator DataFrame

dummies = pd.get_dummies(df['key'], prefix = 'key')

In [ ]:
# join the dummies with the original data

df_with_dummy = df[['data1']].join(dummies)

In [ ]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [ ]:
# combine get_dummies with a discretization function

np.random.seed(12345)

In [ ]:
values = np.random.randn(10)

In [ ]:
values

array([-0.20470766,  0.47894334, -0.51943872, -0.5557303 ,  1.96578057,
        1.39340583,  0.09290788,  0.28174615,  0.76902257,  1.24643474])

In [ ]:
bins = [0, .2, .4, .6, .8, 1]

In [ ]:
pd.cut(values, bins)

[NaN, (0.4, 0.6], NaN, NaN, NaN, NaN, (0.0, 0.2], (0.2, 0.4], (0.6, 0.8], NaN]
Categories (5, interval[float64]): [(0.0, 0.2] < (0.2, 0.4] < (0.4, 0.6] < (0.6, 0.8] < (0.8, 1.0]]

In [ ]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           0
1           0           0           1           0           0
2           0           0           0           0           0
3           0           0           0           0           0
4           0           0           0           0           0
5           0           0           0           0           0
6           1           0           0           0           0
7           0           1           0           0           0
8           0           0           0           1           0
9           0           0           0           0           0

## 7.3 String Manipulation

In [ ]:
# string object methods

val = 'a, b, guido'

In [ ]:
# split( ) can be broken into pieces

val.split(',')

['a', ' b', ' guido']

In [ ]:
# strip( ) can be used to trim whitespace

pieces = [x.strip( ) for x in val.split(',')]

In [ ]:
pieces

['a', 'b', 'guido']

In [ ]:
# unpacking and concatenation

first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [ ]:
# equivalent way: pass a list to the join method on the string':'

'::'.join(pieces)

'a::b::guido'

In [ ]:
# locating substring

'guido' in val

True

In [ ]:
val.index(',')

1

In [ ]:
val.find(':') # index raises an exception if the string isn't found

-1

In [ ]:
# count raises the number of occurences of a particular substring
# count the ,

val.count(',')

2

In [ ]:
val.count('a')

1

In [ ]:
# replace will substitute occurrences of one pattern for another

val.replace(',', '::')

'a:: b:: guido'

In [ ]:
val.replace(',', '') # replace empty string to delete patterns

'a b guido'

#### Regular Expressions

In [ ]:
import re

In [ ]:
text = 'foo          bar\tbaz\t qux'
text

'foo          bar\tbaz\t qux'

In [ ]:
# split a string with a variable number of whitespacce characters
# (tabs, spaces and newlines)

In [ ]:
# use \s+ here

re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [ ]:
# equivalently compile the regex to form a reusable regex object
# just like a function--> can be reused 

regex = re.compile('\s+')

In [ ]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [ ]:
# findall : get a list of all patterns matching the regex

regex.findall(text)

['          ', '\t', '\t ']

In [ ]:
# match and search

text = '''Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
'''

In [ ]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [ ]:
# re.IGNORECASE makes the regex case-insensitive

regex = re.compile(pattern, flags = re.IGNORECASE)

In [ ]:
# findall returns all matches

regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [ ]:
# search returns a special match object

m = regex.search(text)

In [ ]:
m

In [ ]:
# match only matches at the beginning of the string

print(regex.match(text))

None

In [ ]:
# sub will return a new string with occurences of the pattern
# replaces by the new string
# here redacted = xxx@xxx(the pattern)

print(regex.sub('Redacted', text))

Dave Redacted
Steve Redacted
Rob Redacted
Ryan Redacted

* find all email addresses and simultaneously segement each address into three components
* use parentheses around the parts of the patterrn to segment

In [ ]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [ ]:
regex = re.compile(pattern, flags = re.IGNORECASE)

In [ ]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [ ]:
# sub has access to groups in each match special symbols 
# corresponds to the first matched group

print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

#### Vectorized String Functions in pandas

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
data = {'Dave':'dave@google.com',
       'Steve':'steve@gmail.com',
       'Rob':'rob@gmail.com',
       'Wes':np.nan}
data = pd.Series(data)

In [ ]:
# series has array-oriented method for string operation that 
# skip NA values accessed through Series's str attribute

In [ ]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [ ]:
# regular expressions can be used, with any re options like IGNORECASE

pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [ ]:
data.str.findall(pattern, flags = re.IGNORECASE)

Dave     [dave@google.com]
Steve    [steve@gmail.com]
Rob        [rob@gmail.com]
Wes                    NaN
dtype: object

In [ ]:
# vectorized element retieval

matches = data.str.findall(pattern, flags = re.IGNORECASE)

In [ ]:
matches

Dave     [dave@google.com]
Steve    [steve@gmail.com]
Rob        [rob@gmail.com]
Wes                    NaN
dtype: object

In [ ]:
matches.str.get(0)

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [ ]:
matches = data.str.findall(pattern, flags = re.IGNORECASE).str[0]

In [ ]:
matches

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [ ]:
matches.str.get(0)

Dave       d
Steve      s
Rob        r
Wes      NaN
dtype: object

In [ ]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [ ]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
pattern

'[A-Z0-9._%+-]+@[A-Z0-9.-]+\\.[A-Z]{2,4}'

In [ ]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

* NOTE!! You need to add **()** outside the pattern to capture the matched groups

In [ ]:
# extract method will return the captured groups of 
# a regular expression as a DataFrame

data.str.extract(r'([A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4})',
                 flags=re.IGNORECASE)

                     0
Dave   dave@google.com
Steve  steve@gmail.com
Rob      rob@gmail.com
Wes                NaN